artillery/script1-100-learners.yml
#https://www.artillery.io/docs/reference/test-script
# - testInitScript1 reset the sessions [src/tools/ToolsBaseApi.js - resetTestEnvironment]
# - testRunScript1 run the script [src/scripts/Script1.js] insde chromium via playwright
config:
  target: http://localhost:2020/
  phases:
    - name: test-script1-default-debug
      duration: 1000
      # scripts expected to run in one thread (worker 1)
      # one vuser created every 2 seconds
      arrivalCount: 100
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: ./tests-artillery.js
before:
  flow:
     - function: testInitScript1
scenarios:
  - engine: playwright
    testFunction: testRunScript1