artillery/script1-50-learners-2-threads.yml
#https://www.artillery.io/docs/reference/test-script
# - testInitScript1 reset the sessions [src/tools/ToolsBaseApi.js - resetTestEnvironment]
# - testRunScript1 run the script [src/scripts/Script1.js] insde chromium via playwright
config:
  target: http://localhost:2020/
  phases:
    - name: test-script1-localnpm run list
      duration: 25
      # scripts expected to run in 2 thread (worker 1 and 2)
      arrivalRate: 2
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: ./tests-artillery.js
before:
  flow:
     - function: testInitScript1
scenarios:
  - engine: playwright
    testFunction: testRunScript1