artillery/script1-local-debug.yml
#https://www.artillery.io/docs/reference/test-script

# Launch only one script
# - initTest reset the sessions [src/tools/ToolsBaseApi.js - resetTestEnvironment]
# - script1 run the script [src/scripts/Script1.js] insde chromium via playwright
config:
  target: http://localhost:2020/
  payload:
    # The VUser context provides the values to the script (usercontext.vars.learnername / usercontext.vars.learnername )
    path: 5000-learners.csv
    fields:
      - learnername
      - password
    order: sequence
  # debug -> one worker
  # Load the Playwright engine:
  phases:
    - name: test script1
      duration: 100
      arrivalCount: 50
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: ./tests-artillery.js
before:
  flow:
     - function: testInitScript1
scenarios:
  - engine: playwright
    testFunction: testRunScript1