artillery/test-vusers-multiple-threads-50-workers.yml
#https://www.artillery.io/docs/reference/test-script
# COMMAND WORKERS=200 artillery run ./artillery/test-vusers.yml
# creates 200 workers and run one script per worker 
config:
  target: http://localhost:2020/
  phases:
    - name: test-vusers-multiple-thread
      duration: 1
      # artillery needs multiple threads to run 50 scripts per second in one second
      # we force artillery to use a pool of maxVusers (50) workers instead of the default pool (11)
      # on the console we should see W001 to W050 with _learnerCounter starting from 0 to 24500 (50-1)*500 (SLDX_ARTILLERY_WORKER_OFFSET)
      maxVusers: 50
      arrivalRate: 50
  engines:
    playwright: {}
  processor: "./tests-artillery.js"
scenarios:
  - engine: playwright
    testFunction: "testVUsers"