artillery/test-vusers-multiple-threads.yml
#https://www.artillery.io/docs/reference/test-script
# COMMAND WORKERS=200 artillery run ./artillery/test-vusers.yml
# creates 200 workers and run one script per worker 
config:
  target: http://localhost:2020/
  phases:
    - name: test-vusers-multiple-thread
      duration: 1
      # with arrivalRate (nb scipts launched per second) artillery needs multiple threads to run 50 scripts per second in one second
      # it will use it's default pool of 11 workers (we don't force maxVusers)
      # on the console we should see W001 to W011 with _learnerCounter starting from 0 to 5000 (11-1)*500 (SLDX_ARTILLERY_WORKER_OFFSET)
      arrivalRate: 50
  engines:
    playwright: {}
  processor: "./tests-artillery.js"
scenarios:
  - engine: playwright
    testFunction: "testVUsers"