artillery/test-vusers-one-thread.yml
#https://www.artillery.io/docs/reference/test-script
config:
  target: http://localhost:2020/
  phases:
    - name: test-vusers-one-thread
      duration: 10
      # with arrivalCount artillery needs one threads to run 5 script per second in 10 second
      arrivalCount: 50
  engines:
    playwright: {}
  processor: "./tests-artillery.js"
scenarios:
  - engine: playwright
    testFunction: "testVUsers"