artillery/test-vusers.yml
#https://www.artillery.io/docs/reference/test-script
# COMMAND WORKERS=200 artillery run ./artillery/test-vusers.yml
# creates 200 workers and run one script per worker 
config:
  target: http://localhost:2020/
  phases:
    - name: Warm up phase
      duration: 1
      maxVusers: 200
      arrivalRate: 200

#--------------------------------------------------------------------------------
# The following example creates 20 virtual users in 60 seconds (one virtual user approximately every 3 seconds):
#
#config:
#  target: "https://staging.example.com"
#  phases:
#    - duration: 60
#      arrivalCount: 20
#--------------------------------------------------------------------------------
# This phase will run for 60 seconds. Artillery will start by creating 5 new virtual users per second, and gradually 
# ramp up to 10 new virtual users per second by the end of the phase. 
#   phases:
#     - duration: 60
#     - arrivalRate: 5
#     - rampTo: 10
#     - name: Warm up the API
#--------------------------------------------------------------------------------
  # Load the Playwright engine:
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: "./tests.js"
scenarios:
  - engine: playwright
    testFunction: "testVUsers"