artillery/test-workers.yml
config:
  target: http://localhost:2020/
  phases:
    - name: test workers
      duration: 1
      maxVusers: 3
      arrivalRate: 3
  engines:
    playwright: {}
  processor: "./tests-artillery.js"
before:
  flow:
     - function: mainWorkerThread
scenarios:
  - engine: playwright
    testFunction: "testWorkers"